[
  {
    "name": "Nuvyta Mobile App",
    "cover": "img/nuvyta-mobile/cover.png",
    "description": "Nuvyta is a clinical platform highly recognized in Italy. It's necessary to create a mobile design to allow medical personnel to access it from any device, with any screen size.",
    "article": "<p><strong>Nuvyta is a clinical platform highly recognized in Italy</strong>. It is designed to be used on hospital computers. <strong>It's necessary to&nbsp;create a mobile design</strong>&nbsp;to allow users to access it from any device, with any screen size.</p><p>The platform consists of a dashboard view with widgets inside. First the overall platform will be adapted to mobile, with a new navigation and touch friendly inputs, then each widget will be redesigned to fit the new medium.</p><p><strong>I led the project</strong>&nbsp;and worked on all aspects of the <strong>design system</strong>, including its <strong>visual, UX and motion design</strong>. I also <strong>revamped the UX of each widget to recreate it in mobile</strong>, while asking for feedback from my managers.</p><p>Note: for legal reasons no pictures of the project can be shown, but there are some informational graphics.</p><h3>Creating a base design</h3><p>As mentioned before:</p><ul><li>Nuvyta is a <strong>dashboard based clinic platform</strong></li><li>Its <strong>target audience are doctors, nurses and patients.</strong></li><li>Each dashboard can be personalized and can contain a <strong>vast assortment of widgets.</strong></li></ul><p>I had to remake it for mobile.</p><p><strong>The first step I took was focusing on the navigation.</strong> We needed a navigation that was fast, versatile and reminded users of the desktop counterpart. I sketched some ideas, some good and some bad, and <strong>built simple wireframes for a user test.</strong> During the test I noticed that <strong>the most intuitive designs for the testers were those in which common ui patterns were used.</strong> I tried testing new ideas to see how they would work but most of them would be confusing to users and therefore discarded.</p><p>The <strong>final navigation&nbsp;consisted of common and&nbsp;simple patterns,</strong> such as a sidebar and a bottom navigation menu.</p><p>With the navigation finished, <strong>I started working on how the content would be shown.</strong> For the dashboard, I thought about having each widget be the max width of the screen (with some margins), and have a single column. If we allowed custom layouts like with the desktop version, the limited screen size would make it difficult to read each widget and be very hard to handle from the developer&rsquo;s perspective. Therefore we will have a predefined and simple one column layout until there&rsquo;s enough space to accommodate the widgets.</p><img src=\"img/nuvyta-mobile/custom-vs-simple-layout.png\" alt=\"Comparison of custom and single column layout\"><p>It will then increase to a two column layout on tablet devices.</p><img src=\"img/nuvyta-mobile/tablet-layout.png\" alt=\"Comparison of custom and single column layout\"><p>While I was analyzing this, I also noticed that the internal scroll had to be removed from the widgets, otherwise it would be awkward to scroll up and down if your finger &ldquo;got caught&rdquo; inside the widget.</p><p>The final result is:</p><ul><li>A <strong>single column layout,</strong> with a card for each widget.</li><li><strong>They will not have internal scrolling or be interactive</strong>&nbsp;but they will hold valuable information at a glance.</li><li>If the user wants to interact with the widget he can touch it and a <strong>fullscreen popup</strong>&nbsp;will appear, this way he can <strong>have enough breathing space</strong>&nbsp;and <strong>focus on one task at a time.</strong></li></ul><img src=\"img/nuvyta-mobile/popup-example.png\" alt=\"Comparison of custom and single column layout\"><p>I then designed some general components of the platform, such as a global search, how forms behave, how popups and modals would be shown, and added some basic motion design.</p><h3>The Widgets</h3><p><strong>After creating a base for the design, I started working on each widget.</strong> We have many widgets with different purposes, and it was a difficult and long task to redesign everything. Each widget required special attention.</p><p>My method to redesign a widget was:</p><ol start=\"1\"><li><strong>Understand the widget,</strong> by interacting with it or reading documentation. Also creating a flowchart.</li><li><strong>Search on the internet for inspiration</strong>&nbsp;or solution to design problems.</li><li><strong>Create some&nbsp;sketches and wireframes</strong>&nbsp;to create an assortment of ideas.</li><li>Select some ideas to&nbsp;<strong>create a few&nbsp;prototypes and observe which is most optimal</strong>&nbsp;at completing the task.</li></ol><p>All of this would be complemented with <strong>feedback from my managers,</strong> I would show them my progress and they would give me ideas to improve it. <strong>They would typically select the final prototype.</strong></p><p><strong>Some widgets would be difficult to recreate,</strong> especially those with plenty of information. <strong>An example of this was any&nbsp;widget with tables,</strong> which are very inconvenient to use on mobile for the limited horizontal space. Depending on the context <strong>I would change them for different UI Patterns,</strong> for example I could create a vertical table where one column has the titles of the original table and the second column has the value, and it repeats for every line. Or I could change it into a list view, even make it responsive by hiding the less important columns. Basically I would choose the best approach for every context.</p><img src=\"img/nuvyta-mobile/table-example.png\" alt=\"Comparison of custom and single column layout\"><p>Until this day, I have used this approach to redesign about 20 widgets, and I&rsquo;m still doing it! Everyday I encounter new ideas and patterns that I use to improve each widget. I love rethinking something and <strong>simplifying it to the point where anyone can understand it.</strong></p><h3>Conclusion</h3><p>Compared to the desktop version, <strong>the mobile version of Nuvyta allows doctors to access it from any device.</strong> Every widget has been simplified greatly but retaining most of its capabilities.</p><p><strong>This was the first time I led a project.</strong> Although I was nervous at the beginning, I soon learnt to create a series of steps I follow to redesign new widgets efficiently.</p><p>There are still some widgets waiting to be redesigned for mobile, and I'm slowly covering every use case. <strong>Eventually I would like to do user tests of this project</strong>&nbsp;to fix what needs to be changed, and <strong>solidify Nuvyta in the mobile space.</strong></p>"
  },
  {
    "name": "Newronika iPad App",
    "cover": "img/newronika/cover.png",
    "description": "Newronika is a clinical company that produces neural devices to fight brain disorders. It's necessary to design a new iPad App with extra functionalities",
    "article": "<p><strong>Newronika is a clinical company that produces neural devices to fight brain disorders</strong>. A <strong>second device </strong>is necessary to control and receive feedback from the implant, but it had <strong>limited capabilities </strong>and was<strong> complicated to keep it up to date</strong> once a software update was necessary.</p><p><strong>The solution proposed was an external app</strong> that could be used specifically in tablets (ideally an iPad mini). This way the app could be updated easily and the company and users would save money in unnecessary hardware.</p><p>I collaborated alongside a product designer to understand how the devices work and how we could build the app. He would create the navigation and flowcharts, while I would manage the visual design, design system and create the structure of each screen based on his advice.</p><p><strong>The objective was clear: design an tablet app </strong>that would be easier to use, adaptable and intuitive to use. Here's all the devices used in the process (the UI on the laptop wasn&rsquo;t designed by me):</p><h3>First Steps and Failed Mockup</h3><p><strong>I first talked to a manager in Newronika who explained everything</strong>. He talked about how the app was intended to be used in an iPad Mini since its small size made it comfortable to use, how navigation should be, what each section should contain, how some screen would look like based on the current device. I was overwhelmed, neurology is a complicated topic and I had no idea how to approach it. However this would change later on when the product designer arrived.</p><p><strong>I had proposed to use Material Design 3 </strong>for our design system since:</p><ul><li>It&rsquo;s adaptable and versatile.</li><li>Has modern design patterns and components.</li><li>Works specially good on touch devices.</li></ul><p>Together with the same manager, <strong>we designed some wireframes, and decided on a final structure</strong>, a left sidebar for navigation, a main area and a secondary area to aid in the current context.</p><p>The &lsquo;context area&rsquo; typically contains settings to change in the main area, and could also not be present if it&rsquo;s not necessary.</p><p>When it comes to visual design, <strong>we settled on green as a main color</strong> (despite me suggesting to use orange to fit the brand) <strong>and used</strong> <strong>Material Design 3 components</strong> without any major modifications.</p><p>We had already built some screens and started to have a feel for the app. However, <strong>all our work would be rejected</strong> once the product designer arrived. He explained how <strong>green had nothing to do with the brand</strong> and suggested <strong>changing the design system to better fit our use case</strong>: medical data can be complex and detailed so we need a library with compact components, to fit as much information as possible. We could have modified Material Design 3 but with time constraints we decided to use a design system better suited for our needs. Even though my work was discarded, I didn't mind since I agreed with the changes.</p><h3>The Actual App</h3><p>From this point on, I worked alongside the product designer to create the app. He would choose an existing design system from the internet and layed out a more specific navigation, he would create flowcharts and explain to me how the product worked and how the users would interact with it.</p><p>My job consisted of:</p><ul><li><strong>Designing the screens</strong> the product designer asked me for.</li><li><strong>Find efficient ways to show the information</strong> keeping everything clean and readable.</li><li><strong>Keep everything touch friendly</strong> by making inputs fat finger friendly and keeping the most used actions near comfortable areas.</li></ul><p>We would also take some ideas from the previous designs since it was mostly the visual style that was wrong and not the UX.</p><p>Everything went smoothly,<strong> I would create many iterations of the same screen and he would choose the best one.</strong> We would also modify the design system to suit our needs or create new components. When I was away (because I worked part-time here and part-time at Nuvyta)<strong> he would take the designs and show them to possible users and stakeholders, such as neurologists, and give me feedback that I would use to fix the mockups.</strong></p><p>Due to time and budget restraints, we would not be able to do user tests. Therefore, once I created a <strong>final polished prototype</strong>, everything was finished. Although I wish we could have done more.</p><h3>Conclusion</h3><p>Compared with the previous version device, <strong>the app would be easily updatable, more versatile with new extra features, had a modern design approach and was cheaper and more intuitive to use.</strong></p><p>Neurology is a very complicated topic to tackle, but I could trust my teammates to help me understand everything.<strong> It was fundamental to stay communicated by having calls</strong> and showing them my mockups to receive feedback.</p><p><strong>With a polished prototype finished, we could do user testing.</strong> This would give valuable feedback on how users see the app to improve it further and settle on a final design.</p>"
  }
]
