[
  {
    "name": "Nuvyta Mobile App",
    "cover": "img/nuvyta-mobile/cover.png",
    "description": "Nuvyta is a clinical platform highly recognized in Italy. It's necessary to create a mobile design to allow medical personnel to access it from any device, with any screen size.",
    "article": "<p><strong>Nuvyta is a clinical platform highly recognized in Italy</strong>. It is designed to be used on hospital computers. <strong>It's necessary to&nbsp;create a mobile design</strong>&nbsp;to allow users to access it from any device, with any screen size.</p><p>The platform consists of a dashboard view with widgets inside. First the overall platform will be adapted to mobile, with a new navigation and touch friendly inputs, then each widget will be redesigned to fit the new medium.</p><p><strong>I led the project</strong>&nbsp;and worked on all aspects of the <strong>design system</strong>, including its <strong>visual, UX and motion design</strong>. I also <strong>revamped the UX of each widget to recreate it in mobile</strong>, while asking for feedback from my managers.</p><p>Note: for legal reasons no pictures of the project can be shown, but there are some informational graphics.</p><h3>Creating a base design</h3><p>As mentioned before:</p><ul><li>Nuvyta is a <strong>dashboard based clinic platform</strong></li><li>Its <strong>target audience are doctors, nurses and patients.</strong></li><li>Each dashboard can be personalized and can contain a <strong>vast assortment of widgets.</strong></li></ul><p>I had to remake it for mobile.</p><p><strong>The first step I took was focusing on the navigation.</strong> We needed a navigation that was fast, versatile and reminded users of the desktop counterpart. I sketched some ideas, some good and some bad, and <strong>built simple wireframes for a user test.</strong> During the test I noticed that <strong>the most intuitive designs for the testers were those in which common ui patterns were used.</strong> I tried testing new ideas to see how they would work but most of them would be confusing to users and therefore discarded.</p><p>The <strong>final navigation&nbsp;consisted of common and&nbsp;simple patterns,</strong> such as a sidebar and a bottom navigation menu.</p><p>With the navigation finished, <strong>I started working on how the content would be shown.</strong> For the dashboard, I thought about having each widget be the max width of the screen (with some margins), and have a single column. If we allowed custom layouts like with the desktop version, the limited screen size would make it difficult to read each widget and be very hard to handle from the developer&rsquo;s perspective. Therefore we will have a predefined and simple one column layout until there&rsquo;s enough space to accommodate the widgets.</p><img src=\"img/nuvyta-mobile/custom-vs-simple-layout.png\" alt=\"Comparison of custom and single column layout\"><p>It will then increase to a two column layout on tablet devices.</p><img src=\"img/nuvyta-mobile/tablet-layout.png\" alt=\"Comparison of custom and single column layout\"><p>While I was analyzing this, I also noticed that the internal scroll had to be removed from the widgets, otherwise it would be awkward to scroll up and down if your finger &ldquo;got caught&rdquo; inside the widget.</p><p>The final result is:</p><ul><li>A <strong>single column layout,</strong> with a card for each widget.</li><li><strong>They will not have internal scrolling or be interactive</strong>&nbsp;but they will hold valuable information at a glance.</li><li>If the user wants to interact with the widget he can touch it and a <strong>fullscreen popup</strong>&nbsp;will appear, this way he can <strong>have enough breathing space</strong>&nbsp;and <strong>focus on one task at a time.</strong></li></ul><img src=\"img/nuvyta-mobile/popup-example.png\" alt=\"Comparison of custom and single column layout\"><p>I then designed some general components of the platform, such as a global search, how forms behave, how popups and modals would be shown, and added some basic motion design.</p><h3>The Widgets</h3><p><strong>After creating a base for the design, I started working on each widget.</strong> We have many widgets with different purposes, and it was a difficult and long task to redesign everything. Each widget required special attention.</p><p>My method to redesign a widget was:</p><ol start=\"1\"><li><strong>Understand the widget,</strong> by interacting with it or reading documentation. Also creating a flowchart.</li><li><strong>Search on the internet for inspiration</strong>&nbsp;or solution to design problems.</li><li><strong>Create some&nbsp;sketches and wireframes</strong>&nbsp;to create an assortment of ideas.</li><li>Select some ideas to&nbsp;<strong>create a few&nbsp;prototypes and observe which is most optimal</strong>&nbsp;at completing the task.</li></ol><p>All of this would be complemented with <strong>feedback from my managers,</strong> I would show them my progress and they would give me ideas to improve it. <strong>They would typically select the final prototype.</strong></p><p><strong>Some widgets would be difficult to recreate,</strong> especially those with plenty of information. <strong>An example of this was any&nbsp;widget with tables,</strong> which are very inconvenient to use on mobile for the limited horizontal space. Depending on the context <strong>I would change them for different UI Patterns,</strong> for example I could create a vertical table where one column has the titles of the original table and the second column has the value, and it repeats for every line. Or I could change it into a list view, even make it responsive by hiding the less important columns. Basically I would choose the best approach for every context.</p><img src=\"img/nuvyta-mobile/table-example.png\" alt=\"Comparison of custom and single column layout\"><p>Until this day, I have used this approach to redesign about 20 widgets, and I&rsquo;m still doing it! Everyday I encounter new ideas and patterns that I use to improve each widget. I love rethinking something and <strong>simplifying it to the point where anyone can understand it.</strong></p><h3>Conclusion</h3><p>Compared to the desktop version, <strong>the mobile version of Nuvyta allows doctors to access it from any device.</strong> Every widget has been simplified greatly but retaining most of its capabilities.</p><p><strong>This was the first time I led a project.</strong> Although I was nervous at the beginning, I soon learnt to create a series of steps I follow to redesign new widgets efficiently.</p><p>There are still some widgets waiting to be redesigned for mobile, and I'm slowly covering every use case. <strong>Eventually I would like to do user tests of this project</strong>&nbsp;to fix what needs to be changed, and <strong>solidify Nuvyta in the mobile space.</strong></p>"
  },
  {
    "name": "Walk for the World",
    "cover": "img/spotify/cover.png",
    "description": "Air pollution is a significant issue that affects everyone. I decided to create a fictitional campaign to analyze how an app like Spotify could help fight the problem.",
    "article": "<p>In today&#39;s world, <strong>air pollution is a significant issue that affects everyone</strong>. With more and more people becoming conscious of the impact of pollution on the environment and their health, <strong>it&#39;s essential to raise awareness and encourage individuals to take action.</strong> In this context, <strong>Spotify, one of the most popular music streaming apps, can play a crucial role in spreading the word and inspiring its users to make positive changes</strong>. This proposal outlines some ideas for how Spotify can leverage its platform to promote walking, reduce car usage, and educate its audience about air pollution, specifically targeting Gen Z and Millennials in Europe, where Spotify has the most active user base.</p><ul><li>Topic: Air pollution.</li><li>App: Spotify.</li><li>Target: Gen Z and Millennials. Europe being the most active country for Spotify.</li><li>Numbers: time spent using Spotify (25 hours/month), 1/3 of this time on curated playlists.</li><li>Ideas:<ul><li>Generate a user specific playlist for walking.</li><li>Add a modal screen to invite users to walk and listen to the playlist or any podcast on the topic.</li><li>Add a dedicated section in the homepage.</li><li>For non-premium users, when an ad comes up and there isn’t an ad available, instead of showing the default Spotify premium ad, talk about air pollution and how the user can help.</li></ul></li></ul><h3>Research</h3><p><strong>My first step was understanding how the Spotify Design System “Encore” works</strong>. I looked at the app from my phone and analyze every component to understand how can I send the message to the users. I searched online and read articles about Spotify’s Design System and how it was built.</p><p>I choose approaches that were already there to not clash with the existing design, but rather take advantage of it. This is how I chose a:</p><ul><li>Modal</li><li>Dedicated section</li><li>Advertisement</li><li>Generated playlist.</li></ul><p>In summary, every choice made was based on an existing approaches.</p><p><img src=\"img/spotify/app_ad.png\" alt=\"Example of Spotify screen\"></p><h3>Modal Screen</h3><p><strong>The modal will show up when the user opens Spotify</strong>. It’s an invitation to walk and avoid using the car. The playlist and podcasts serve as inspiration to take action.</p><p>Here&#39;s an example:</p><p><img src=\"img/spotify/modal_1.png\" alt=\"First modal mockup\"></p><p>Then there’s an alternative modal, the lack of imagery gives a more serious tone to the problem.</p><img src=\"img/spotify/modal_2.png\" alt=\"Second modal mockup\"><p><strong>I&#39;ve chosen to use a modal to give the users an immediate and clear CTA</strong>. If there wasn’t a modal, the other approaches would probably be ignored since they don’t require as much attention.</p><h3>Dedicated section</h3><p>This section is located at the homescreen, visible after the user sees the modal.</p><img src=\"img/spotify/dedicated_section.png\" alt=\"Spotify's dedicated section\"><p>It will contain the Spotify generated playlist and some podcasts on the topic of air pollution if the user wants get informed.</p><p>This is very common in the Spotify Design System. I choose this approach since:</p><ul><li>It flows with the content</li><li><strong>The user can keep scrolling</strong> and ignore it</li><li><strong>The user has have a central place to come back to</strong> in case they want to check it out some other time.</li></ul><h3>Advertisement</h3><p>It will show up only to non-premium users.</p><p><strong>The ad will explain why the user should pay attention to air pollution and what he can do to help</strong>, such as walking or taking public transport instead of using their car. Finally, it will invite to check out the playlist and some podcasts.</p><p><strong>It will show up when the user is listening to content and it’s time for an advertisement but there isn’t one available</strong>. Could also be played when the user is using Spotify inside the car.</p><p>I chose this approach since Spotify shows an ad even if they are not available, so <strong>we could take advantage of this and send our message, specially to driving users.</strong></p><img src=\"img/spotify/advertisement.png\" alt=\"Example of Spotify playlist\"><h3>Personalized Playlist</h3><p>This is how the playlist will look when the user opens it. It would be based on the user’s tastes and generated automatically by Spotify.</p><img src=\"img/spotify/playlist.png\" alt=\"First modal mockup\"><p>Also <strong>the playlist could be regenerated every day</strong> to allow the user to listen everyday when they are walking and not get bored of the same repeating songs.</p><p><strong>I chose this approach to inspire the users. It could be irritating to be asked to take a walk, so the playlist and podcast can encourage a desired and healthier behavior.</strong></p><h3>Conclusion</h3><p>To communicate the importance of air pollution, the first step was to research on Spotify, to understand how their Design System could handle this task. Looking at many use cases and different components, I decided to use these approaches: </p><ul><li><strong>Modal screen:</strong> to give an immediate and clear CTA.</li><li><strong>Dedicated section on homescreen:</strong> serves as a central point to return to.</li><li><strong>Advertisement:</strong> will show only to non-premium users when and advertisement is not available, to take advantage of the empty space and inform directly those who are driving.</li><li><strong>Personalized playlist and podcasts:</strong> to encourage users to walk.</li></ul><p>All of these decisions were based on existing designs, this will help keep the app consistent and avoid introducing new unnecessary components and possibly changing the UX/UI of the app.</p><h3>References</h3><p><a href=\"https://kommandotech.com/statistics/spotify-user-statistics/\">Spotify User Statistics</a><a href=\"https://www.start.io/blog/spotify-target-market-segmentation-user-demographics-audience-targeting-strategy/#:~:text=The%20typical%20Spotify%20user%20is,also%20enjoy%20the%20app&#39;s%20music.\">Spotify Market Segmentation </a><a href=\"https://spotify.design/article/can-i-get-an-encore-spotifys-design-system-three-years-on\">Can I get an Encore? Spotify’s Design System, Three Years On</a><br><a href=\"https://undraw.co/\">unDraw</a> used for the illustration in the modal and playlist cover<br><a href=\"https://unsplash.com/\">Unplash</a> used for the pictures in the album covers<br>Tools used: Figma for the Mockups</p>"
  },
  {
    "name": "Hike with Me User Flow",
    "cover": "img/hike-with-me/cover.png",
    "description": "Hike with Me is an app based on searching hikes on a map and join groups. They asked me to design wireframe screens based on the user flow",
    "article": "<p>This was one of my most complex projects, Hike with Me is an app based on searching hikes on a map and join groups. They asked me to design wireframe screens based on the user flow, so I had to think about how certain users would interact with each screen and how it could change.</p><p> My two user personas are Joaquin and Shania, Joaquin is a more experienced hiker while Shania downloaded the app out of curiosity.</p><p> I learned how to get in the mind of the users to give them what they need to keep using this app, and how this can change depending on the user. I learned to add and remove features mindfully to give the best experience to every possible outcome.</p><h3>Project's Problem</h3><p> The objective of this project was to think about the \"path\" that the different users are going to take to create a wireframe based on this analysis. I developed empathy by getting on the shoes of the user personas to give them what they would need in order to schedule or join a hike with their friends or with new people.</p><h3>Project's Audience</h3><p> This project had two user personas: Joaquin, an experienced hiker who wants to organize hikes with his friends, and Shania, who is just getting started and would like to meet new people to interact with and get guidance. Two opposite users, but with the same objective: hiking with groups of friends.</p><h3>My Process</h3><p> My first step as an UX Designer was to develop empathy for my users, I considered their concerns, motivations and mostly, needs. After giving some thought, I used post-its to create a general user flow of how the app would behave for every user, considering what is required for getting to their objectives. You can see it here:</p><a href=\"img/hike-with-me/flowsketch.jpeg\" target=\"_blank\"> <img src=\"img/hike-with-me/flowsketch.jpeg\" alt=\"Flowsketch organized withpost its\"/></a><p> I recreated my user flow on digital for a more clean read, and looked at it from the perspective of my users. For example, if I was Shania, I would appreciate some guidance on where to proceed, I would then choose and join a hike to meet people. The same goes for Joaquin, I would probably login and schedule a Hike to invite my friends since I'm experienced. You can see the different flows here:</p><a href=\"img/hike-with-me/general_f.png\" target=\"_blank\"> <img src=\"img/hike-with-me/general_f.png\" alt=\"General user flow\"/></a><a href=\"img/hike-with-me/joaquin_f.png\" target=\"_blank\"> <img src=\"img/hike-with-me/joaquin_f.png\" alt=\"Joaquin's user flow\"/></a><a href=\"img/hike-with-me/shania_f.png\" target=\"_blank\"> <img src=\"img/hike-with-me/shania_f.png\" alt=\"Shania's user flow\"/></a><p> With a clear structure built, I started wireframing on Balsamiq, I went on logical order (from signup/login to finishing a hike) to really feel like my users and understand which info they need and when. I made sure that every needed information and interaction is in its right place.</p><p> The main screens are: scheduling a hike, joining a hike, finishing a hike and rating a hike, since there's where resides the main objective of the app: to get user to hike together.</p><p> <strong>Schedule a Hike:</strong> I added a map and the possible hikes with the distance and difficulty to give an easy glance, and allow users to compare options. After they have choosen a trail, they would be required to fill extra info like the date, participants and most importantly: allow guests to join. This permits users like Shania to join hiking groups. Then they can set limits like the number of guests and their experience level. If the host forgot to invite friends or they don't have the app, he can copy and send the invite link on the Hike Summary Page.</p><a href=\"img/hike-with-me/schedule_a_hike.png\" target=\"_blank\"> <img src=\"img/hike-with-me/schedule_a_hike.png\" alt=\"Schedule a hike\"/></a><p> <strong>Join a Hike:</strong> just as in Scheduling a Hike, the users can see the map and compare the options, I think this would be important given the different levels of experience that the hikers could have. Shania, our user persona, can click a trail on the map or filter by date, distance and difficulty if she doesn't find good results. If the host allows it, Shania can invite her friends with the link.</p><a href=\"img/hike-with-me/join_a_hike.png\" target=\"_blank\"> <img src=\"img/hike-with-me/join_a_hike.png\" alt=\"Join a hike\"/></a><p> <strong>Finished a Hike:</strong> this screen would show the obtained XP Points on the hike for two main reasons: to motivate users to keep going, and to give them and understanding of what level they're at. It also shows data about the hike and the user, such as, distance, difficulty, total hikes, etc. It allows users to add those who participated in the hike as well to remain in contact and maybe rejoin in a new one. Finally, the users can take a picture with their friends to remember the moment and rate the hike.</p><a href=\"img/hike-with-me/finished_a_hike.png\" target=\"_blank\"> <img src=\"img/hike-with-me/finished_a_hike.png\" alt=\"Finished a hike\"/></a><p> <strong>Rate a Hike:</strong> I implemented a like/dislike system to facilitate the use on tiny screens. There's the option to comment and add photos, and you can see what the other participants are saying.</p><a href=\"img/hike-with-me/rate_a_hike.png\" target=\"_blank\"> <img src=\"img/hike-with-me/rate_a_hike.png\" alt=\"Rate a hike\"/></a><p> My last step on this project was to rearrange the screens according to user, you can see the final results here:</p><a href=\"img/hike-with-me/joaquin_w.png\" target=\"_blank\"> <img src=\"img/hike-with-me/joaquin_w.png\" alt=\"Joaquin's wireframes\"/></a><a href=\"img/hike-with-me/shania_w.png\" target=\"_blank\"> <img src=\"img/hike-with-me/shania_w.png\" alt=\"Shania's wireframe\"/></a><h3>Outcome and What I Learned</h3><p> The outcome are the wireframes and user flows created. This would be the base for any upcoming developing. I learned from this project to create and cultivate empathy to make design decisions, stepping in my user's shoes helped me create a versatile product that would adapt to each user. I learned to create user flows and to predict the next step a user might do.</p>"
  },
  {
    "name": "Pet Finder Sign Up Form",
    "cover": "img/pet-finder/cover.png",
    "description": "Instant Pet Finder is an idea for an app that focuses on finding cute pets for cute users. I’ve been given the task to make the registration section on a wireframe.",
    "article": "<p>Instant Pet Finder is an idea for an app that focuses on finding cute pets for cute users. I’ve been given the task to make the registration section on a wireframe. So I used design patters to make an enjoyable and engaging flow.</p><p>This project was interesting to me because I learned about Design Patterns, how people are used to certain repeating aspects of design, and how we can help our users implementing this in our favor. I learned to apply these patterns, how to inform users about their current actions, how to organize information and overall, how to make a design less frustrating and more engaging.</p><h3>Project's Problem</h3><p>My objective in this project was to design the signup form for a the app. A form like this requires many design patterns to give the users an enjoyable experience and avoid overwhelming them; therefore, in theory, design patterns increase conversion rates (marketing term user for when an user completes an action). The main point is to get user to complete the registration.</p><h3>Project's Audience</h3><p>The user personas would be people interested in adopting a pet, who, out of the top of my mind, I guess they would be economically stable, like workers, couples and or families, looking for a new partner.</p><h3>My Process</h3><p>My first step was to individuate those design patterns that I can use in my favor, in particular I used:</p><ul><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/Sequencing\" class=\"link\" >Sequencing</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/StepsLeft\" class=\"link\" >Steps left</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/VerticalDropdownMenu\" class=\"link\" >Dropdown menu</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/PasswordStrengthMeter\" class=\"link\" >Password strength meter</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/InputFeedback\" class=\"link\" >Input feedback</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/categorization\" class=\"link\" >Categorization</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/ProgressiveDisclosure\" class=\"link\" >Progressive disclosure</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/InputPrompt\" class=\"link\" >Input prompt</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/Thumbnail\" class=\"link\" >Thumbnails</a ></li><li><a target=\"_blank\" href=\"http://ui-patterns.com/patterns/Recognition-over-recall\" class=\"link\" >Recognition over recall</a ></li></ul><p>I started assembling everything on the mobile version, since it's easier to reorganize it to make a desktop version rather than the other way around. My first step was the data filling, I included the necessary fields with input prompts, which indicate examples of how to format data:</p><a href=\"img/pet-finder/inputprompt.png\" target=\"_blank\"><img src=\"img/pet-finder/inputprompt.png\" /></a><p>On the State and City field I added a dropdown menu to keep the screen organized. On the password section I included a strenght meter to encourage users to create a strong password with advice on how to do it.</p><a href=\"img/pet-finder/mobile1.png\" target=\"_blank\"><img src=\"img/pet-finder/mobile1.png\" /></a><p>In the case that an user misses an input or types badly formatted text, a brief message will show up, explaining the error and how to solve it, check it out:</p><a href=\"img/pet-finder/mobile2.png\" target=\"_blank\"><img src=\"img/pet-finder/mobile2.png\" /></a><p>You can also see the progress bar on top: this helps the users know how many steps are left and encourages them to complete the registration. It also separates the tasks into more manageable steps.</p><a href=\"img/pet-finder/progressbar.png\" target=\"_blank\"><img src=\"img/pet-finder/progressbar.png\" /></a><p>On the pets section, I implemented two main patterns:</p><ul><li><strong>Recognition over recall: </strong>we show the pets in thumbnails to help the user choose one. Then, more options show up and the user can narrow its search while seeing and recognizing what he likes. </li><li><strong>Progressive Disclosure: </strong>more options show up only after the users chooses, this avoids overwhelm them by showing little by little the options. The user can also continue with a simple option without narrowing it down. </li></ul><a href=\"img/pet-finder/mobile3.png\" target=\"_blank\"><img src=\"img/pet-finder/mobile3.png\" /></a><p>Lastly, the Final Steps section helps users start doing something in the app. In this point, the user is registered and we can send him \"emails about adoptable pets\", which will show a feedback message when selected.</p><a href=\"img/pet-finder/mobile4.png\" target=\"_blank\"><img src=\"img/pet-finder/mobile4.png\" /></a><p>After completing the mobile version, it was easy to continue designing the desktop version. I basically rearranged everything and added images to fill the empty space. The only major difference is the pets tab, which will show an image of the pet that matches with the user's result.</p><a href=\"img/pet-finder/desktop1.png\" target=\"_blank\"><img src=\"img/pet-finder/desktop1.png\" /></a><a href=\"img/pet-finder/desktop2.png\" target=\"_blank\"><img src=\"img/pet-finder/desktop2.png\" /></a><a href=\"img/pet-finder/desktop3.png\" target=\"_blank\"><img src=\"img/pet-finder/desktop3.png\" /></a><h3>Outcome and What I Learned</h3><p>The final results are the previous screens, which could the be developed to create a prototype and a full design. This project taught me about creating an enjoyable flow with design patterns, using psychology principles that improve a design's experience.</p>"
  }
]
